Revit 2017 API
FamilyPointLocation.Location Property
 The location of the point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public Transform Location { get; }
Visual Basic
Public ReadOnly Property Location As Transform
	Get
Visual C++
public:
property Transform^ Location {
	Transform^ get ();
}
See Also
FamilyPointLocation Class
Autodesk.Revit.DB Namespace